tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
    if (Esp32BaseOta::isUploading() || Esp32BaseOta::status() == Esp32BaseOta::SUCCESS) {
        BoardHardware::instance().safeShutdown();
        Esp32Base::handle();
        return;
    }
    IrrigationRecordSync::instance().handle(millis());
    advanceBusiness();
    IrrigationIot::instance().handle(*this);
    updateStatusIndicator(nowMs);
    Esp32Base::handle();
}

bool IrrigationApp::baseReady() const {
    return baseReady_;
}

bool IrrigationApp::businessReady() const {
    return businessReady_;
}

WateringStartResult IrrigationApp::startWatering(const WateringRequest& request) {
    if (Esp32BaseOta::isUploading() || Esp32BaseOta::status() == Esp32BaseOta::SUCCESS) {
        return WateringStartResult::Busy;
    }
    if (!businessReady_) {
        return WateringStartResult::NotReady;
    }
    if (wateringController_.active()) {
        return WateringStartResult::Busy;
    }
    if (wateringController_.finishedSession()) {
        return WateringStartResult::PreviousResultPending;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }

    if (request.purpose == WateringPurpose::Normal) {
        const auto& records = IrrigationRecordSync::instance();
        if (!records.writable(IrrigationRecordSync::StreamKind::Watering) ||
            (request.source == WateringSource::AutomaticPlan &&
             !records.writable(IrrigationRecordSync::StreamKind::Audit)))
            return WateringStartResult::NotReady;
    }
    Esp32BaseRecordStore::RecordStartTime startTime;
    const bool captured = wateringRecordStore_.captureStartTime(startTime);
    const WateringStartResult result = wateringController_.start(request, *config, millis());
    if (result == WateringStartResult::Started) {
        wateringStartTime_ = startTime;
        wateringStartTimeValid_ = captured;
    }
    return result;
}

WateringStartResult IrrigationApp::startManualWatering(
    const std::array<uint16_t, BoardPins::kZoneCount>& zoneDurationMinutes) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::Normal;
    for (uint8_t index = 0; index < config->zones.size(); ++index) {
        if (zoneDurationMinutes[index] == 0) {
            continue;
        }
        if (!config->zones[index].enabled ||
            zoneDurationMinutes[index] > config->runLimits.maximumZoneDurationMinutes) {
            return WateringStartResult::InvalidRequest;
        }
        request.steps[request.stepCount++] = {
            config->zones[index].id,
            static_cast<uint32_t>(zoneDurationMinutes[index]) * 60U,
        };
    }
    return startWatering(request);
}

WateringStartResult IrrigationApp::startSingleOutput(uint8_t zoneId,
                                                     uint32_t targetDurationSec,
                                                     uint32_t targetWaterMl) {
    const IrrigationConfig* config = configStore_.current();
    const uint32_t maximumDurationSec = config
        ? static_cast<uint32_t>(config->runLimits.maximumZoneDurationMinutes) * 60U
        : 0U;
    const uint32_t maximumWaterMl = config
        ? static_cast<uint32_t>(config->runLimits.maximumSingleOutputLiters) * 1000U
        : 0U;
    if (!config || !BoardPins::isValidZoneId(zoneId) ||
        !config->zones[BoardPins::zoneIndex(zoneId)].enabled ||
        targetDurationSec == 0 || targetDurationSec > maximumDurationSec ||
        (targetWaterMl != 0 &&
         (targetWaterMl < 100U || targetWaterMl > maximumWaterMl))) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::SingleOutput;
    request.purpose = WateringPurpose::Normal;
    request.stepCount = 1;
    request.steps[0] = {zoneId, targetDurationSec, targetWaterMl};
    return startWatering(request);
}

bool IrrigationApp::stopWatering() {
    return businessReady_ && wateringController_.stop(millis());
}

WateringStatus IrrigationApp::wateringStatus() const {
    return wateringController_.status();
}

FlowHistorySnapshot IrrigationApp::wateringFlowHistory() const {
    return wateringController_.flowHistory();
}

bool IrrigationApp::readLatestWateringRecords(uint32_t offset,
                                              uint32_t limit,
                                              WateringRecordStore::ReadCallback callback,
                                              void* user) {
    return wateringRecordStore_.readLatest(offset, limit, callback, user);
}

Esp32BaseRecordStore::RecordReadResult IrrigationApp::readWateringRecordById(
    uint32_t recordId,
    StoredWateringRecord& record) {
    return wateringRecordStore_.readById(recordId, record);
}

bool IrrigationApp::readWateringRecordStoreStatus(
    Esp32BaseRecordStore::StoreStatus& status) const {
    return wateringRecordStore_.readStatus(status);
}

bool IrrigationApp::readLatestEvents(uint32_t offset,
                                     uint32_t limit,
                                     IrrigationEvents::ReadCallback callback,
                                     void* user) const {
    return events_.readLatest(offset, limit, callback, user);
}

bool IrrigationApp::readEventStatus(IrrigationEvents::EventStatus& status) const {
    return events_.readStatus(status);
}

IrrigationEvents::ConditionDisplayState IrrigationApp::eventConditionState(
    uint8_t conditionId) const {
    return events_.conditionState(conditionId);
}

bool IrrigationApp::recordStorageFault() const {
    return recordStorageFault_ ||
           !IrrigationRecordSync::instance().writable(IrrigationRecordSync::StreamKind::Watering);
}

bool IrrigationApp::eventStorageFault() const {
    return events_.storageFault();
}

bool IrrigationApp::schedulerStorageFault() const {
    return schedulerStorageFault_;
}

bool IrrigationApp::checkpointStorageFault() const {
    return aliveCheckpoint_.storageFault();
}

uint32_t IrrigationApp::lastKnownAliveEpoch() const {
    return aliveCheckpoint_.lastKnownAliveEpoch();
}

bool IrrigationApp::unexpectedFlowAlarm() const {
    return unexpectedFlowMonitor_.alarmActive();
}

