tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
    if (summary->purpose == WateringPurpose::ZoneFlowLearning &&
               summary->zoneCount == 1 &&
               summary->zones[0].suggestedBaselinePulseRateX10000 != 0) {
        pendingLearnedZoneId_ = summary->zones[0].zoneId;
        pendingLearnedBaselinePulseRateX10000_ =
            summary->zones[0].suggestedBaselinePulseRateX10000;
    }

    if (summary->purpose == WateringPurpose::Normal) {
        if (!finishedWateringStored_) {
            finishedWateringStored_ = wateringStartTimeValid_ &&
                IrrigationRecordSync::instance().appendWatering(
                    wateringStartTime_, *summary,
                    IrrigationIot::instance().activeCommandId());
        }
        recordStorageFault_ = !finishedWateringStored_ ||
            !IrrigationRecordSync::instance().writable(
                IrrigationRecordSync::StreamKind::Watering);
        // Keep the finished summary until both facts commit. A failed audit must
        // never cause a second watering append or change its completion time.
        if (!finishedWateringStored_ ||
            !events_.recordAutomaticRun(wateringRecordStore_.completionTiming(), *summary)) return;
    }

    resetUnexpectedFlowMonitor(nowMs);
    applyPendingHardwareConfiguration();
    wateringController_.clearFinishedSession();
    finishedWateringStored_ = false;
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
}

uint32_t IrrigationApp::trustedEpoch() const {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return now.synced ? now.epochSec : 0;
}

void IrrigationApp::applyPendingHardwareConfiguration() {
    if (!pendingPwmReconfigure_ || wateringController_.active()) {
        return;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config || !BoardHardware::instance().configureValvePwmFrequency(
                       config->valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = false;
}

void IrrigationApp::updateStatusIndicator(uint32_t nowMs) {
    StatusIndicator::Mode mode = StatusIndicator::Mode::ReadyIdle;
    if (!businessReady_ || recordStorageFault() || eventStorageFault() ||
        schedulerStorageFault_ || checkpointStorageFault() || unexpectedFlowAlarm()) {
        mode = StatusIndicator::Mode::Critical;
    } else if (wateringController_.active()) {
        mode = StatusIndicator::Mode::Active;
    }
    statusIndicator_.setMode(mode, nowMs);
    statusIndicator_.handle(nowMs);
}

void IrrigationApp::parameterConfigSaved(void* user) {
    if (user) static_cast<IrrigationApp*>(user)->handleParameterConfigSaved();
}

bool IrrigationApp::applyStoredParameterConfig() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return false;
    parameterConfigScratch_ = *current;
    return IrrigationParameterConfig::applyStored(parameterConfigScratch_) &&
           configStore_.applyRuntimeParameters(parameterConfigScratch_);
}

bool IrrigationApp::validateParameterConfig(const IrrigationConfig& proposed,
                                            char* error,
                                            size_t errorLength,
                                            void* user) {
    const auto* app = static_cast<IrrigationApp*>(user);
    const IrrigationConfig* current = app ? app->configStore_.current() : nullptr;
    if (!current) return true;
    for (const WateringPlan& plan : current->plans) {
        if (!plan.configured) continue;
        for (uint8_t zoneIndex = 0; zoneIndex < plan.zoneDurationMinutes.size(); ++zoneIndex) {
            if (plan.zoneDurationMinutes[zoneIndex] >
                proposed.runLimits.maximumZoneDurationMinutes) {
                std::snprintf(error,
                              errorLength,
                              "计划“%s”的水路 %u 为 %u 分钟，请先调整计划。",
                              plan.name.data(),
                              static_cast<unsigned>(zoneIndex + 1U),
                              static_cast<unsigned>(plan.zoneDurationMinutes[zoneIndex]));
                return false;
            }
        }
    }
    return true;
}

void IrrigationApp::handleParameterConfigSaved() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return;
    parameterConfigScratch_ = *current;
    if (!IrrigationParameterConfig::applyStored(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    const bool frequencyChanged = parameterConfigScratch_.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    const bool active = wateringController_.active();
    if (frequencyChanged && !active &&
        !BoardHardware::instance().configureValvePwmFrequency(
            parameterConfigScratch_.valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    if (!configStore_.applyRuntimeParameters(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) resetUnexpectedFlowMonitor(millis());
    events_.recordConfigurationChanged(
        IrrigationEvents::ConfigurationChange::SystemParametersUpdated,
        0,
        configStore_.current());
}

void IrrigationApp::resetUnexpectedFlowMonitor(uint32_t nowMs) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return;
    }
    unexpectedFlowMonitor_.begin(
        nowMs,
        BoardHardware::instance().flowPulseCount(),
        config->flowProtection.unexpectedFlowDelaySec,
        config->flowProtection.unexpectedFlowWindowSec,
        config->flowProtection.unexpectedFlowPulseCount);
    events_.observeClosedValveFlow(Esp32BaseConditions::ObservedState::Unknown,
                                   0,
                                   0,
                                   config->flowProtection.unexpectedFlowWindowSec,
                                   config->flowProtection.unexpectedFlowPulseCount);
}

